# ✅ Label text for various statuses and information
LABELS = {
    "persiapan": "𝙋𝙚𝙧𝙨𝙞𝙖𝙥𝙖𝙣 𝙐𝙥𝙡𝙤𝙖𝙙 𝘽𝙖𝙩𝙘𝙝",
    "informasi": "𝙄𝙣𝙛𝙤𝙧𝙢𝙖𝙨𝙞",
    "peringatan": "𝙋𝙚𝙧𝙞𝙣𝙜𝙖𝙩𝙖𝙣",
    "status": "𝙎𝙩𝙖𝙩𝙪𝙨",
    "batch_selesai": "𝘽𝙖𝙩𝙘𝙝 𝙐𝙥𝙡𝙤𝙖𝙙 𝙎𝙚𝙡𝙚𝙨𝙖𝙞!",
    "sukses_upload": "𝙎𝙚𝙢𝙪𝙖 𝙫𝙞𝙙𝙚𝙤 𝙗𝙚𝙧𝙝𝙖𝙨𝙞𝙡 𝙙𝙞𝙪𝙥𝙡𝙤𝙖𝙙!",
    "tidak_ada_file": "𝙏𝙞𝙙𝙖𝙠 𝙖𝙙𝙖 𝙛𝙞𝙡𝙚 𝙫𝙞𝙙𝙚𝙤 𝙮𝙖𝙣𝙜 𝙙𝙞𝙩𝙚𝙢𝙪𝙠𝙖𝙣 𝙪𝙣𝙩𝙪𝙠 𝙙𝙞𝙪𝙥𝙡𝙤𝙖𝙙.",

    "detail_upload": "𝘿𝙚𝙩𝙖𝙞𝙡 𝙐𝙥𝙡𝙤𝙖𝙙",
    "file": "𝙁𝙞𝙡𝙚",
    "nama": "𝙉𝙖𝙢𝙖",
    "ukuran": "𝙐𝙠𝙪𝙧𝙖𝙣",
    "durasi": "𝘿𝙪𝙧𝙖𝙨𝙞",
    "resolusi": "𝙍𝙚𝙨𝙤𝙡𝙪𝙨𝙞",
    "video": "𝙑𝙞𝙙𝙚𝙤",
    "audio": "𝘼𝙪𝙙𝙞𝙤",
    "bitrate": "𝘽𝙞𝙩𝙧𝙖𝙩𝙚",
    "cleanup": "𝘾𝙡𝙚𝙖𝙣𝙪𝙥",
    "waktu": "𝙒𝙖𝙠𝙩𝙪",

    "total_file": "𝙏𝙤𝙩𝙖𝙡 𝙁𝙞𝙡𝙚",
    "total_ukuran": "𝙏𝙤𝙩𝙖𝙡 𝙐𝙠𝙪𝙧𝙖𝙣",
    "total_waktu": "𝙏𝙤𝙩𝙖𝙡 𝙒𝙖𝙠𝙩𝙪",

    "error": "𝙀𝙧𝙧𝙤𝙧"
}

# Separator for label formatting
SEP = " »"
