# ✅ Label text for various statuses and information
LABELS = {
    "preparation": "𝙐𝙥𝙡𝙤𝙖𝙙 𝘽𝙖𝙩𝙘𝙝 𝙋𝙧𝙚𝙥𝙖𝙧𝙖𝙩𝙞𝙤𝙣",
    "info": "𝙄𝙣𝙛𝙤𝙧𝙢𝙖𝙩𝙞𝙤𝙣",
    "warning": "𝙒𝙖𝙧𝙣𝙞𝙣𝙜",
    "status": "𝙎𝙩𝙖𝙩𝙪𝙨",
    "batch_done": "𝘽𝙖𝙩𝙘𝙝 𝙐𝙥𝙡𝙤𝙖𝙙 𝘾𝙤𝙢𝙥𝙡𝙚𝙩𝙚!",
    "upload_success": "𝘼𝙡𝙡 𝙫𝙞𝙙𝙚𝙤𝙨 𝙝𝙖𝙫𝙚 𝙗𝙚𝙚𝙣 𝙨𝙪𝙘𝙘𝙚𝙨𝙨𝙛𝙪𝙡𝙡𝙮 𝙪𝙥𝙡𝙤𝙖𝙙𝙚𝙙!",
    "no_video_found": "𝙉𝙤 𝙫𝙞𝙙𝙚𝙤 𝙛𝙞𝙡𝙚𝙨 𝙛𝙤𝙪𝙣𝙙 𝙩𝙤 𝙪𝙥𝙡𝙤𝙖𝙙.",

    "upload_details": "𝙐𝙥𝙡𝙤𝙖𝙙 𝘿𝙚𝙩𝙖𝙞𝙡𝙨",
    "file": "𝙁𝙞𝙡𝙚",
    "name": "𝙉𝙖𝙢𝙚",
    "size": "𝙎𝙞𝙯𝙚",
    "duration": "𝘿𝙪𝙧𝙖𝙩𝙞𝙤𝙣",
    "resolution": "𝙍𝙚𝙨𝙤𝙡𝙪𝙩𝙞𝙤𝙣",
    "video": "𝙑𝙞𝙙𝙚𝙤",
    "audio": "𝘼𝙪𝙙𝙞𝙤",
    "bitrate": "𝘽𝙞𝙩𝙧𝙖𝙩𝙚",
    "cleanup": "𝘾𝙡𝙚𝙖𝙣𝙪𝙥",
    "time": "𝙏𝙞𝙢𝙚",

    "total_files": "𝙏𝙤𝙩𝙖𝙡 𝙁𝙞𝙡𝙚𝙨",
    "total_size": "𝙏𝙤𝙩𝙖𝙡 𝙎𝙞𝙯𝙚",
    "total_time": "𝙏𝙤𝙩𝙖𝙡 𝙏𝙞𝙢𝙚",

    "error": "𝙀𝙧𝙧𝙤𝙧"
}

# Separator for label formatting
SEP = " »"
