# ✅ Label teks untuk berbagai status dan informasi
LABELS = {
    "persiapan": "𝘗𝘦𝘳𝘴𝘪𝘢𝘱𝘢𝘯 𝘜𝘱𝘭𝘰𝘢𝘥 𝘉𝘢𝘵𝘤𝘩",
    "informasi": "𝘐𝘯𝘧𝘰𝘳𝘮𝘢𝘴𝘪",
    "peringatan": "𝘗𝘦𝘳𝘪𝘯𝘨𝘢𝘵𝘢𝘯",
    "status": "𝘚𝘵𝘢𝘵𝘶𝘴",
    "batch_selesai": "𝘉𝘢𝘵𝘤𝘩 𝘜𝘱𝘭𝘰𝘢𝘥 𝘚𝘦𝘭𝘦𝘴𝘢𝘪!",
    "sukses_upload": "𝘚𝘦𝘮𝘶𝘢 𝘷𝘪𝘥𝘦𝘰 𝘣𝘦𝘳𝘩𝘢𝘴𝘪𝘭 𝘥𝘪𝘶𝘱𝘭𝘰𝘢𝘥!",
    "tidak_ada_file": "𝘛𝘪𝘥𝘢𝘬 𝘢𝘥𝘢 𝘧𝘪𝘭𝘦 𝘷𝘪𝘥𝘦𝘰 𝘺𝘢𝘯𝘨 𝘥𝘪𝘵𝘦𝘮𝘶𝘬𝘢𝘯 𝘶𝘯𝘵𝘶𝘬 𝘥𝘪𝘶𝘱𝘭𝘰𝘢𝘥.",
    "detail_upload": "𝘋𝘦𝘵𝘢𝘪𝘭 𝘜𝘱𝘭𝘰𝘢𝘥",
    
    "file": "𝘍𝘪𝘭𝘦",
    "nama": "𝘕𝘢𝘮𝘢",
    "ukuran": "𝘜𝘬𝘶𝘳𝘢𝘯",
    "durasi": "𝘋𝘶𝘳𝘢𝘴𝘪",
    "resolusi": "𝘙𝘦𝘴𝘰𝘭𝘶𝘴𝘪",
    "video": "𝘝𝘪𝘥𝘦𝘰",
    "audio": "𝘈𝘶𝘥𝘪𝘰",
    "bitrate": "𝘉𝘪𝘵𝘳𝘢𝘵𝘦",
    "cleanup": "𝘊𝘭𝘦𝘢𝘯𝘶𝘱",
    "waktu": "𝘞𝘢𝘬𝘵𝘶",

    "total_file": "𝘛𝘰𝘵𝘢𝘭 𝘍𝘪𝘭𝘦",
    "total_ukuran": "𝘛𝘰𝘵𝘢𝘭 𝘜𝘬𝘶𝘳𝘢𝘯",
    "total_waktu": "𝘛𝘰𝘵𝘢𝘭 𝘞𝘢𝘬𝘵𝘶",

    "error": "𝘌𝘳𝘳𝘰𝘳"
}

SEP = " »"
